# GetHookRotationAngle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..GetHookRotationAngle Method
Rebar Class See Also
---
Gets the out of plane hook rotation angle at the specified end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public double GetHookRotationAngle(
	int iEnd
)
```

Visual Basic
---
```text
Public Function GetHookRotationAngle ( _
	iEnd As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetHookRotationAngle(
	int iEnd
)
```

# ### Parameters
iEnd
    Type: System..::..Int32 0 for the start , 1 for the end.
# ### Return Value
Returns the out of plane hook rotation angle at the specified end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | iEnd must be 0 or 1. |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace